IDEA Open Model
HingeTypeInDirrection Enumeration
Compatible with IDEA StatiCa 20.1
 Type of hinge in the direction
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public enum HingeTypeInDirrection
Public Enumeration HingeTypeInDirrection
Members
Member name | Value | Description
NoHinge | 0 |  No hinge defined
FullHinge | 1 |  Full hinge, zero stiffness is aplied
Flexible | 2 |  Initial stiffness is aplied
Nonlinear | 3 |  Nonlinear function is aplied
See Also
Reference
IdeaRS.OpenModel.Model Namespace